---
kind: method
id: M:Autodesk.Revit.DB.CurveExtents.Dispose
source: html/bce535f3-b323-3f9a-9380-0402e0c0db81.htm
---
# Autodesk.Revit.DB.CurveExtents.Dispose Method

Releases all resources used by the CurveExtents

## Syntax (C#)
```csharp
public void Dispose()
```